calculator-ws-client/calculator.asmx.postman_collection.json

{
	"info": {
		"_postman_id": "51544993-ca01-4903-a4f9-f57f9dc6d134",
		"name": "calculator.asmx",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
	},
	"item": [
		{
			"name": "calculator.asmx",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"name": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tem=\"http://tempuri.org/\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <tem:Add>\n         <tem:intA>9</tem:intA>\n         <tem:intB>1</tem:intB>\n      </tem:Add>\n   </soapenv:Body>\n</soapenv:Envelope>"
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					]
				}
			},
			"response": []
		},
		{
			"name": "Get Calculator Params Add (Sum)",
			"request": {
				"method": "GET",
				"header": [],
				"url": {
					"raw": "localhost:8080/add?n1=1&n2=4",
					"host": [
						"localhost"
					],
					"port": "8080",
					"path": [
						"add"
					],
					"query": [
						{
							"key": "n1",
							"value": "1"
						},
						{
							"key": "n2",
							"value": "4"
						}
					]
				}
			},
			"response": []
		}
	]
}